# Rename Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheetSetting..::..Rename Method
ViewSheetSetting Class See Also
---
Rename the current view sheet set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Rename(
	string newName
)
```

Visual Basic
---
```text
Public Function Rename ( _
	newName As String _
) As Boolean
```

Visual C++
---
```text
public:
bool Rename(
	String^ newName
)
```

# ### Parameters
newName
    Type: System..::..StringView sheet set name to be renamed as.
# ### Return Value
False if Rename operation fails, otherwise True.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the input name is already existed in current view sheet set list. |

# See Also
ViewSheetSetting Class
Autodesk.Revit.DB Namespace